04_tests/reports/performance/raw/interface-comparison-2026-08-28/microservices-detail-run1.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ply/softw/new/softw/04_tests/performance/k6-interface-comparison.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 50s max duration (incl. graceful stop):
              * interface_comparison: 5 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 1213 complete and 0 interrupted iterations
interface_comparison   [   5% ] 5 VUs  01.0s/20s

running (02.0s), 5/5 VUs, 2501 complete and 0 interrupted iterations
interface_comparison   [  10% ] 5 VUs  02.0s/20s

running (03.0s), 5/5 VUs, 3841 complete and 0 interrupted iterations
interface_comparison   [  15% ] 5 VUs  03.0s/20s

running (04.0s), 5/5 VUs, 5250 complete and 0 interrupted iterations
interface_comparison   [  20% ] 5 VUs  04.0s/20s

running (05.0s), 5/5 VUs, 6688 complete and 0 interrupted iterations
interface_comparison   [  25% ] 5 VUs  05.0s/20s

running (06.0s), 5/5 VUs, 7964 complete and 0 interrupted iterations
interface_comparison   [  30% ] 5 VUs  06.0s/20s

running (07.0s), 5/5 VUs, 9328 complete and 0 interrupted iterations
interface_comparison   [  35% ] 5 VUs  07.0s/20s

running (08.0s), 5/5 VUs, 10689 complete and 0 interrupted iterations
interface_comparison   [  40% ] 5 VUs  08.0s/20s

running (09.0s), 5/5 VUs, 12022 complete and 0 interrupted iterations
interface_comparison   [  45% ] 5 VUs  09.0s/20s

running (10.0s), 5/5 VUs, 13313 complete and 0 interrupted iterations
interface_comparison   [  50% ] 5 VUs  10.0s/20s

running (11.0s), 5/5 VUs, 14639 complete and 0 interrupted iterations
interface_comparison   [  55% ] 5 VUs  11.0s/20s

running (12.0s), 5/5 VUs, 15840 complete and 0 interrupted iterations
interface_comparison   [  60% ] 5 VUs  12.0s/20s

running (13.0s), 5/5 VUs, 17158 complete and 0 interrupted iterations
interface_comparison   [  65% ] 5 VUs  13.0s/20s

running (14.0s), 5/5 VUs, 18517 complete and 0 interrupted iterations
interface_comparison   [  70% ] 5 VUs  14.0s/20s

running (15.0s), 5/5 VUs, 19907 complete and 0 interrupted iterations
interface_comparison   [  75% ] 5 VUs  15.0s/20s

running (16.0s), 5/5 VUs, 21170 complete and 0 interrupted iterations
interface_comparison   [  80% ] 5 VUs  16.0s/20s

running (17.0s), 5/5 VUs, 22542 complete and 0 interrupted iterations
interface_comparison   [  85% ] 5 VUs  17.0s/20s

running (18.0s), 5/5 VUs, 23914 complete and 0 interrupted iterations
interface_comparison   [  90% ] 5 VUs  18.0s/20s

running (19.0s), 5/5 VUs, 25246 complete and 0 interrupted iterations
interface_comparison   [  95% ] 5 VUs  19.0s/20s

running (20.0s), 5/5 VUs, 26578 complete and 0 interrupted iterations
interface_comparison   [ 100% ] 5 VUs  20.0s/20s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<2000' p(95)=4.99ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 53168   2657.996915/s
    checks_succeeded...: 100.00% 53168 out of 53168
    checks_failed......: 0.00%   0 out of 53168

    ✓ status is 200
    ✓ response contains fixed dataset

    HTTP
    http_req_duration..............: avg=3.71ms min=2.09ms med=3.51ms max=25.89ms p(90)=4.36ms p(95)=4.99ms
      { expected_response:true }...: avg=3.71ms min=2.09ms med=3.51ms max=25.89ms p(90)=4.36ms p(95)=4.99ms
    http_req_failed................: 0.00%  0 out of 26584
    http_reqs......................: 26584  1328.998457/s

    EXECUTION
    iteration_duration.............: avg=3.75ms min=2.14ms med=3.55ms max=25.93ms p(90)=4.41ms p(95)=5.03ms
    iterations.....................: 26584  1328.998457/s
    vus............................: 5      min=5          max=5
    vus_max........................: 5      min=5          max=5

    NETWORK
    data_received..................: 32 MB  1.6 MB/s
    data_sent......................: 3.2 MB 159 kB/s



running (20.0s), 0/5 VUs, 26584 complete and 0 interrupted iterations
interface_comparison ✓ [ 100% ] 5 VUs  20s